# St7ScaleByToroidalUCS

Scales the radius of selected entities in a toroidal coordinate system.

Strand7 API Manual

long St7ScaleByToroidalUCS(long uID, long UCSId, double Factor)

Input Parameters

uID

Strand7 model file ID.

UCSId

The toroidal system in which to scale.

Factor

Factor by which to scale the radius.

Dependencies
Selection

Entities can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.